public class Trips {
  //TODO  подменю чтоб посмотреть поездки
  public static void lookTrip(){

    //     - Вывести все поездки {номер, название стоимость общая, и за одного человека}
    //    - Посмотреть одну поездку:
    //        Вывести список поездок на экран
    //    и выбрать, которая интересует
    //    - в главное меню
  }

  // TODO
  public static void editTrip(){
    //  1. Какую трип хотим отредактировать
    //  2. Какую строчку из списка (листа)
    //  3. изменить / удалить (изменить можем только деньги)
    //  4. через свитч-кейс вызывает соответсвующую статье расходов функцию
  }

  //TODO удаление записи
  public static void deleteTrip(){
  }

  //TODO здесь будем сравнивать поездки
  public static void compareTrip(){
    // 1. выводить на экран printAllTrip()
    // 2. спрашивать какие поездки мы хотим сравнить и по какому показателю или всю
    //     список статей расходов с номерами
    // printComparableTrip(trip1, trip2, parameter)
  }

  // TODO
  private static void printAllTrips(){}

  // TODO
  private static void printTrip(){}



}
